package Chernovik;

public class Main {



}



   /* Написать игру “камень, ножницы, бумага”. Создать интерфейс класс Player с методами:
        ● getName возвращает имя игрока
        ● getMove возвращает решение игрока на текущий ход
        ● addPoint добавляет одно очко игроку, когда он выигрывает
        ● getPoints возвращает количество очков игрока
        Создать двух игроков-наследников Human и Computer
        Имя человеческого игрока Human должно запрашиваться с клавиатуры
        Имя компьютерного игрока можно вернуть любое
        Решение игрока должно запрашиваться с клавиатуры
        Решение компьютера должно выбираться случайно (см. Math.random)
        Создать класс Game, принимающий в конструкторе двух игроков имеющий метод play
        Метод play описывает процесс игры:
        1. Запросить имена игроков
        2. Получить решения игроков и сравнить
        3. Победившему игроку добавляется одно очко
        4. Напечатать результат игры - количество очков у каждого игрока
        5. Спросить у пользователя, хочет ли он продолжить игру
        6. Если да - Перейти к шагу 2. Если нет, к шагу 7
        7. Выйти*/